<?php
// index.php
// 変数：データにつけるラベル（変更可能）
// 定数：変更不可

define("ADMIN_EMAIL", "y-i-group@gmail.com");
define("LIST_COUNT", 15);

echo ADMIN_EMAIL;
echo '<br>';
echo LIST_COUNT;
echo '<br>';

?>


echo "1. デプロイとは"."<br>";
echo "ソフトウェアを構成するプログラムなどをパッケージなどにまとめ、使用環境に導入可能な状態に組み立てる工程（ビルドおよびリリース）、実際の使用環境に展開して導入する工程（インストール）、"."<br>";
echo "プログラムを起動して所定の設定や手続きを行い操作や要求を受け付けられる状態にする工程（アクティベート）などを含む。"."<br>";
echo "2. バリデーションとは"."<br>";
echo "2. データのバリデーションといった場合、記述・入力されたデータが、あらかじめ規定された条件や仕様、形式などに適合しているか"."<br>";
echo "どうかを検証・確認することを表す。形式的な妥当性の検証であり、意味論的に適切な内容かどうかは判断しない。"."<br>";
echo "3. アジャイル・ウォーターフォール(開発手法)とは、システム構築やソフトウェア開発をするときのプロジェクト開発手法です。アジャイルを日本語に訳すと「素早い」「機敏」といった意味になります。"."<br>";
echo "短期の反復期間内で、どんどん機能を追加していく「反復増加タイプ」の開発プロセスによって、アジャイル開発は進んでいきます。アジャイル開発は、ソフトウェアやアプリ開発といった、"."<br>";
echo "開発中で仕様の変更や新しい機能が追加される可能性の高いプロジェクトに向いています。"."<br>";
